Repository: yibie/FileTypeGuard
Catalog: FileTypeGuard/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

# %@ from %@ restored to %@
source: %1$@ from %2$@ restored to %3$@
ja: %1$@ を %2$@ から %3$@ に復元しました
zh_hans: %1$@ 从 %2$@ 恢复为 %3$@
zh_hant: %1$@ 從 %2$@ 恢復為 %3$@

# %@ recovery failed %@
source: %1$@ recovery failed %2$@
ja: %1$@ の復元に失敗しました %2$@
zh_hans: %1$@ 恢复失败 %2$@
zh_hant: %1$@ 恢復失敗 %2$@

source: %lld days
ja: %lld 日
zh_hans: %lld 天
zh_hant: %lld 天

source: %lld records
ja: %lld 件の記録
zh_hans: 共 %lld 条记录
zh_hant: 共 %lld 條記錄

source: %lld seconds
ja: %lld 秒
zh_hans: %lld 秒
zh_hant: %lld 秒

source: About
ja: について
zh_hans: 关于
zh_hant: 關於

source: Add
ja: 追加
zh_hans: 添加
zh_hant: 新增

# add rule failed: %@
source: Failed to add protection rule: %@
ja: 保護ルールの追加に失敗しました: %@
zh_hans: 添加保护规则失败: %@
zh_hant: 新增保護規則失敗: %@

source: Add File Type Protection
ja: ファイルタイプ保護を追加
zh_hans: 添加文件类型保护
zh_hant: 新增檔案類型保護

source: Add Protection
ja: 保護を追加
zh_hans: 添加保护
zh_hant: 新增保護

source: Add Protection Type
ja: 保護タイプを追加
zh_hans: 添加保护类型
zh_hant: 新增保護類型

# add_type_hint
source: Click the + button in the top right to add file type protection
ja: 右上の + ボタンをクリックしてファイルタイプの保護を追加
zh_hans: 点击右上角的 + 按钮添加文件类型保护
zh_hant: 點擊右上角的 + 按鈕新增檔案類型保護

source: Advanced Settings
ja: 詳細設定
zh_hans: 高级设置
zh_hant: 進階設定

source: All
ja: すべて
zh_hans: 全部
zh_hant: 全部

# all_installed_apps
source: All installed apps on this Mac
ja: このMacにインストール済みのすべてのアプリ
zh_hans: 本机所有已安装应用
zh_hant: 本機所有已安裝應用程式

# auto_recovery
source: Auto-restore File Associations
ja: ファイル関連付けを自動復元
zh_hans: 自动恢复文件关联
zh_hant: 自動恢復檔案關聯

# can_open_this_type
source: Can open this file type
ja: このファイルタイプを開けます
zh_hans: 可以打开此类文件
zh_hant: 可以開啟此類檔案

source: Cancel
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# category_archives
source: Archives
ja: アーカイブ
zh_hans: 压缩包
zh_hant: 壓縮檔

# category_audio
source: Audio
ja: 音声
zh_hans: 音频
zh_hant: 音訊

# category_code
source: Code
ja: コード
zh_hans: 代码
zh_hant: 程式碼

# category_communication
source: Communication
ja: コミュニケーション
zh_hans: 通讯
zh_hant: 通訊

# category_data
source: Data
ja: データ
zh_hans: 数据
zh_hant: 資料

# category_documents
source: Documents
ja: 文書
zh_hans: 文档
zh_hant: 文件

# category_images
source: Images
ja: 画像
zh_hans: 图片
zh_hant: 圖片

# category_system
source: System
ja: システム
zh_hans: 系统
zh_hant: 系統

# category_videos
source: Videos
ja: 動画
zh_hans: 视频
zh_hant: 影片

# category_web
source: Web
ja: ウェブ
zh_hans: 网页
zh_hant: 網頁

source: Change Detected
ja: 変更を検出
zh_hans: 检测到变化
zh_hant: 偵測到變化

source: Check Interval
ja: チェック間隔
zh_hans: 检查间隔
zh_hant: 檢查間隔

source: Clear Filter
ja: フィルターをクリア
zh_hans: 清除筛选
zh_hant: 清除篩選

# click_file_type_card
source: Click a file type card on the left
ja: 左側のファイルタイプカードをクリック
zh_hans: 点击左侧的文件类型卡片
zh_hant: 點擊左側的檔案類型卡片

# config_location
source: Config File Location
ja: 設定ファイルの場所
zh_hans: 配置文件位置
zh_hant: 設定檔位置

source: Custom File Extension
ja: カスタムファイル拡張子
zh_hans: 自定义文件扩展名
zh_hant: 自訂檔案副檔名

source: Custom File Type
ja: カスタムファイルタイプ
zh_hans: 自定义文件类型
zh_hant: 自訂檔案類型

source: Custom Scheme
ja: カスタムスキーム
zh_hans: 自定义协议
zh_hant: 自訂協定

source: Custom Type
ja: カスタムタイプ
zh_hans: 自定义类型
zh_hant: 自訂類型

source: Default App
ja: デフォルトアプリ
zh_hans: 默认应用
zh_hant: 預設應用程式

source: Delete
ja: 削除
zh_hans: 删除
zh_hant: 刪除

source: Disable
ja: 無効にする
zh_hans: 禁用
zh_hant: 停用

source: Disabled
ja: 無効
zh_hans: 已禁用
zh_hant: 已停用

source: Edit
ja: 編集
zh_hans: 编辑
zh_hant: 編輯

source: e.g. .xyz
ja: 例: .xyz
zh_hans: 如 .xyz
zh_hant: 如 .xyz

source: Enable
ja: 有効にする
zh_hans: 启用
zh_hant: 啟用

# enable_monitoring
source: Enable File Association Monitoring
ja: ファイル関連付けの監視を有効にする
zh_hans: 启用文件关联监控
zh_hant: 啟用檔案關聯監控

source: Enabled
ja: 有効
zh_hans: 已启用
zh_hant: 已啟用

source: Enter extension
ja: 拡張子を入力
zh_hans: 输入扩展名
zh_hant: 輸入副檔名

# enter_extension_eg_pdf
source: Enter file extension, e.g. .pdf
ja: ファイル拡張子を入力（例: .pdf）
zh_hans: 输入文件扩展名，如 .pdf
zh_hant: 輸入檔案副檔名，如 .pdf

# enter_scheme
source: Enter scheme name
ja: スキーム名を入力
zh_hans: 输入协议名称
zh_hant: 輸入協定名稱

source: Error
ja: エラー
zh_hans: 错误
zh_hant: 錯誤

source: Error: %@
ja: エラー: %@
zh_hans: 错误: %@
zh_hant: 錯誤: %@

source: Event Type
ja: イベントタイプ
zh_hans: 事件类型
zh_hant: 事件類型

source: Failed
ja: 失敗
zh_hans: 失败
zh_hant: 失敗

source: File type: %@
ja: ファイルタイプ: %@
zh_hans: 文件类型: %@
zh_hant: 檔案類型: %@

source: File Type
ja: ファイルタイプ
zh_hans: 文件类型
zh_hant: 檔案類型

source: File Types
ja: ファイルタイプ
zh_hans: 文件类型
zh_hant: 檔案類型

# filetype_7z_archive
source: 7Z Archive
ja: 7Z アーカイブ
zh_hans: 7Z 压缩包
zh_hant: 7Z 壓縮檔

# filetype_aac_audio
source: AAC Audio
ja: AAC 音声
zh_hans: AAC 音频
zh_hant: AAC 音訊

# filetype_avi_video
source: AVI Video
ja: AVI 動画
zh_hans: AVI 视频
zh_hant: AVI 影片

# filetype_c_cpp_code
source: C/C++ Code
ja: C/C++ コード
zh_hans: C/C++ 代码
zh_hant: C/C++ 程式碼

# filetype_css_stylesheet
source: CSS Stylesheet
ja: CSS スタイルシート
zh_hans: CSS 样式
zh_hant: CSS 樣式表

# filetype_csv_data
source: CSV Data
ja: CSV データ
zh_hans: CSV 数据
zh_hant: CSV 資料

# filetype_excel_spreadsheet
source: Excel Spreadsheet
ja: Excel スプレッドシート
zh_hans: Excel 表格
zh_hant: Excel 試算表

# filetype_flac_audio
source: FLAC Audio
ja: FLAC 音声
zh_hans: FLAC 音频
zh_hant: FLAC 音訊

# filetype_gif_image
source: GIF Image
ja: GIF 画像
zh_hans: GIF 图片
zh_hant: GIF 圖片

# filetype_gz_archive
source: GZ Compressed
ja: GZ 圧縮
zh_hans: GZ 压缩
zh_hant: GZ 壓縮

# filetype_heic_image
source: HEIC Image
ja: HEIC 画像
zh_hans: HEIC 图片
zh_hant: HEIC 圖片

# filetype_html_file
source: HTML File
ja: HTML ファイル
zh_hans: HTML 文件
zh_hant: HTML 檔案

# filetype_java_code
source: Java Code
ja: Java コード
zh_hans: Java 代码
zh_hant: Java 程式碼

# filetype_javascript_code
source: JavaScript Code
ja: JavaScript コード
zh_hans: JavaScript 代码
zh_hant: JavaScript 程式碼

# filetype_jpeg_image
source: JPEG Image
ja: JPEG 画像
zh_hans: JPEG 图片
zh_hant: JPEG 圖片

# filetype_json_data
source: JSON Data
ja: JSON データ
zh_hans: JSON 数据
zh_hant: JSON 資料

# filetype_markdown_document
source: Markdown Document
ja: Markdown ドキュメント
zh_hans: Markdown 文档
zh_hant: Markdown 文件

# filetype_mkv_video
source: MKV Video
ja: MKV 動画
zh_hans: MKV 视频
zh_hant: MKV 影片

# filetype_mov_video
source: MOV Video
ja: MOV 動画
zh_hans: MOV 视频
zh_hant: MOV 影片

# filetype_mp3_audio
source: MP3 Audio
ja: MP3 音声
zh_hans: MP3 音频
zh_hant: MP3 音訊

# filetype_mp4_video
source: MP4 Video
ja: MP4 動画
zh_hans: MP4 视频
zh_hant: MP4 影片

# filetype_ogg_audio
source: OGG Audio
ja: OGG 音声
zh_hans: OGG 音频
zh_hant: OGG 音訊

# filetype_pdf_document
source: PDF Document
ja: PDF ドキュメント
zh_hans: PDF 文档
zh_hant: PDF 文件

# filetype_photoshop_file
source: Photoshop File
ja: Photoshop ファイル
zh_hans: Photoshop 文件
zh_hant: Photoshop 檔案

# filetype_png_image
source: PNG Image
ja: PNG 画像
zh_hans: PNG 图片
zh_hant: PNG 圖片

# filetype_powerpoint_presentation
source: PowerPoint Presentation
ja: PowerPoint プレゼンテーション
zh_hans: PowerPoint 演示
zh_hant: PowerPoint 簡報

# filetype_python_code
source: Python Code
ja: Python コード
zh_hans: Python 代码
zh_hant: Python 程式碼

# filetype_rar_archive
source: RAR Archive
ja: RAR アーカイブ
zh_hans: RAR 压缩包
zh_hant: RAR 壓縮檔

# filetype_rtf_document
source: RTF Document
ja: RTF ドキュメント
zh_hans: RTF 文档
zh_hant: RTF 文件

# filetype_svg_image
source: SVG Vector Image
ja: SVG ベクター画像
zh_hans: SVG 矢量图
zh_hant: SVG 向量圖

# filetype_swift_code
source: Swift Code
ja: Swift コード
zh_hans: Swift 代码
zh_hant: Swift 程式碼

# filetype_tar_archive
source: TAR Archive
ja: TAR アーカイブ
zh_hans: TAR 归档
zh_hant: TAR 歸檔

# filetype_text_file
source: Text File
ja: テキストファイル
zh_hans: 文本文件
zh_hant: 文字檔

# filetype_typescript_code
source: TypeScript Code
ja: TypeScript コード
zh_hans: TypeScript 代码
zh_hant: TypeScript 程式碼

# filetype_wav_audio
source: WAV Audio
ja: WAV 音声
zh_hans: WAV 音频
zh_hant: WAV 音訊

# filetype_webm_video
source: WebM Video
ja: WebM 動画
zh_hans: WebM 视频
zh_hant: WebM 影片

# filetype_webp_image
source: WebP Image
ja: WebP 画像
zh_hans: WebP 图片
zh_hant: WebP 圖片

# filetype_word_document
source: Word Document
ja: Word ドキュメント
zh_hans: Word 文档
zh_hant: Word 文件

# filetype_xml_data
source: XML Data
ja: XML データ
zh_hans: XML 数据
zh_hant: XML 資料

# filetype_yaml_data
source: YAML Data
ja: YAML データ
zh_hans: YAML 数据
zh_hant: YAML 資料

# filetype_zip_archive
source: ZIP Archive
ja: ZIP アーカイブ
zh_hans: ZIP 压缩包
zh_hant: ZIP 壓縮檔

source: Filter
ja: フィルター
zh_hans: 筛选
zh_hant: 篩選

source: Filter Criteria
ja: フィルター条件
zh_hans: 筛选条件
zh_hant: 篩選條件

source: Identifying file type...
ja: ファイルタイプを識別中...
zh_hans: 正在识别文件类型...
zh_hant: 正在識別檔案類型...

source: Last verified: %@
ja: 最終確認: %@
zh_hans: 最后验证: %@
zh_hant: 最後驗證: %@

source: Loading app list...
ja: アプリリストを読み込み中...
zh_hans: 正在加载应用列表...
zh_hant: 正在載入應用程式列表...

# log_empty_description
source: When file associations are modified and restored, records will appear here
ja: ファイルの関連付けが変更・復元されると、ここに記録が表示されます
zh_hans: 当文件关联被修改并恢复时，这里会显示记录
zh_hant: 當檔案關聯被修改並恢復時，這裡會顯示記錄

source: Log Records
ja: ログ記録
zh_hans: 日志记录
zh_hant: 日誌記錄

source: Log Retention Days
ja: ログ保持日数
zh_hans: 日志保留天数
zh_hant: 日誌保留天數

source: Logs
ja: ログ
zh_hans: 日志
zh_hant: 日誌

source: Monitoring Settings
ja: 監視設定
zh_hans: 监控设置
zh_hant: 監控設定

source: No Apps Found
ja: アプリが見つかりません
zh_hans: 未找到应用
zh_hant: 未找到應用程式

source: No Log Records
ja: ログ記録なし
zh_hans: 暂无日志记录
zh_hant: 暫無日誌記錄

source: No Protection Types
ja: 保護タイプなし
zh_hans: 暂无保护类型
zh_hant: 暫無保護類型

# notification_association_restored
source: File Association Restored
ja: ファイルの関連付けが復元されました
zh_hans: ✅ 文件关联已恢复
zh_hant: ✅ 檔案關聯已恢復

# notification_recovery_failed
source: Recovery Failed
ja: 復元に失敗しました
zh_hans: ❌ 恢复失败
zh_hant: ❌ 恢復失敗

source: Notification Settings
ja: 通知設定
zh_hans: 通知设置
zh_hant: 通知設定

source: Notification Sound
ja: 通知音
zh_hans: 通知声音
zh_hant: 通知聲音

source: Open
ja: 開く
zh_hans: 打开
zh_hant: 開啟

source: Other Apps
ja: その他のアプリ
zh_hans: 其他应用
zh_hant: 其他應用程式

source: Pending
ja: 保留中
zh_hans: 待处理
zh_hant: 待處理

source: Preview
ja: プレビュー
zh_hans: 预览
zh_hant: 預覽

source: Protected Types
ja: 保護タイプ
zh_hans: 保护类型
zh_hant: 保護類型

source: Recommended
ja: 推奨
zh_hans: 推荐
zh_hant: 推薦

source: Recommended Apps
ja: 推奨アプリ
zh_hans: 推荐应用
zh_hant: 推薦應用程式

source: Refresh List
ja: リストを更新
zh_hans: 刷新列表
zh_hant: 重新整理列表

source: Refresh Logs
ja: ログを更新
zh_hans: 刷新日志
zh_hant: 重新整理日誌

source: Restore Failed
ja: 復元失敗
zh_hans: 恢复失败
zh_hant: 恢復失敗

# restore_success
source: Restore Successful
ja: 復元成功
zh_hans: 恢复成功
zh_hant: 恢復成功

# scheme_facetime_audio
source: FaceTime Audio
ja: FaceTimeオーディオ
zh_hans: FaceTime 音频
zh_hant: FaceTime 音訊

# scheme_mailto
source: Email (mailto)
ja: メール (mailto)
zh_hans: 邮件 (mailto)
zh_hant: 郵件 (mailto)

# scheme_maps
source: Maps
ja: マップ
zh_hans: 地图
zh_hant: 地圖

# scheme_tel
source: Phone (tel)
ja: 電話 (tel)
zh_hans: 电话 (tel)
zh_hant: 電話 (tel)

# scheme_vnc
source: VNC (Screen Sharing)
ja: VNC (画面共有)
zh_hans: VNC (屏幕共享)
zh_hant: VNC (螢幕共享)

# search_app
source: Search apps
ja: アプリを検索
zh_hans: 搜索应用
zh_hant: 搜尋應用程式

# search_app_or_filetype
source: Search apps or file types
ja: アプリまたはファイルタイプを検索
zh_hans: 搜索应用或文件类型
zh_hant: 搜尋應用程式或檔案類型

source: Save
ja: 保存
zh_hans: 保存
zh_hant: 儲存

source: Edit Protection Rule
ja: 保護ルールを編集
zh_hans: 編輯保護規則
zh_hant: 編輯保護規則

source: Select Default App
ja: デフォルトアプリを選択
zh_hans: 选择默认应用
zh_hant: 選擇預設應用程式

# select_file_type
source: Select a File Type
ja: ファイルタイプを選択
zh_hans: 请选择文件类型
zh_hant: 請選擇檔案類型

source: Select URL Scheme
ja: URL スキームを選択
zh_hans: 选择 URL 协议
zh_hant: 選擇 URL 協定

source: Settings
ja: 設定
zh_hans: 设置
zh_hant: 設定

# show_notifications
source: Show System Notifications
ja: システム通知を表示
zh_hans: 显示系统通知
zh_hant: 顯示系統通知

source: Start at Login
ja: ログイン時に起動
zh_hans: 开机自动启动
zh_hant: 開機自動啟動

source: Success
ja: 成功
zh_hans: 成功
zh_hant: 成功

# tagline
source: Your files, always opening the way you expect
ja: あなたのファイルを、いつも期待通りに開く
zh_hans: 你的文件，永远按照你期望的方式打开
zh_hant: 你的檔案，永遠按照你期望的方式開啟

source: Unknown App
ja: 不明なアプリ
zh_hans: 未知应用
zh_hant: 未知應用程式

source: Unrecognized file type
ja: 認識できないファイルタイプ
zh_hans: 未识别的文件类型
zh_hant: 無法識別的檔案類型

source: URL Schemes
ja: URL スキーム
zh_hans: URL 协议
zh_hant: URL 協定

source: User Modified
ja: ユーザー変更
zh_hans: 用户修改
zh_hant: 使用者修改

source: Version
ja: バージョン
zh_hans: 版本
zh_hant: 版本

# %@ %@ → %@
source: %1$@ from %2$@ → %3$@
zh_hans: %1$@ 从 %2$@ → %3$@
zh_hant: %1$@ 從 %2$@ → %3$@

source: OK
zh_hans: 确定
zh_hant: 確定

# scheme_sms
source: SMS
zh_hans: 短信 (SMS)
zh_hant: 簡訊 (SMS)
